/*******************************************************************************
           new和delete运算符用于动态分配和撤销内存的运算符
 *******************************************************************************
 new用法: new 类型 [初值]
 1开辟单变量地址空间
 new int;  //开辟一个存放数组的存储空间,返回一个指向该存储空间的地址.
 int *a = new int 即为将一个int类型的地址赋值给整型指针a. 
 int *a = new int(5) 作用同上,但是同时将整数赋值为5

 2 开辟数组空间
 一维: int *a = new int[100];开辟一个大小为100的整型数组空间
 二维: int **a = new int[5][6]
 三维及其以上:依此类推.


delete用法:
int *a = new int;
delete a;   //释放单个int的空间

int *a = new int[5];
delete [] a; //释放int数组空间

          */
